## Getting to know your data

In [1]:
import pandas as pd

### 1.Use the u.user file and assign it to a dataframe

In [2]:
user_file=pd.read_csv("C:/Users/sushr/Downloads/u.user",sep="|")
user_file

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

### 2.See the first 5 entries

In [3]:
user_file.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

### 3.What is the number of observations in the dataset?

In [4]:
print(user_file.groupby("user_id").size())
print("___________")
print(user_file.groupby("age").size())
print("___________")
print(user_file.groupby("gender").size())
print("___________")
print(user_file.groupby("occupation").size())
print("___________")
print(user_file.groupby("zip_code").size())

user_id
1      1
2      1
3      1
4      1
5      1
      ..
939    1
940    1
941    1
942    1
943    1
Length: 943, dtype: int64
___________
age
7     1
10    1
11    1
13    5
14    3
     ..
66    1
68    2
69    2
70    3
73    1
Length: 61, dtype: int64
___________
gender
F    273
M    670
dtype: int64
___________
occupation
administrator     79
artist            28
doctor             7
educator          95
engineer          67
entertainment     18
executive         32
healthcare        16
homemaker          7
lawyer            12
librarian         51
marketing         26
none               9
other            105
programmer        66
retired           14
salesman          12
scientist         31
student          196
technician        27
writer            45
dtype: int64
___________
zip_code
00000    2
01002    1
01040    1
01080    1
01331    1
        ..
V0R2M    1
V1G4L    1
V3N4P    1
V5A2B    1
Y1A6B    1
Length: 795, dtype: int64

### 4.What is the number of columns in the dataset?

In [5]:
print(f"The number of columns in the dataset are: {user_file.shape[1]}")

The number of columns in the dataset are: 5

In [6]:
# This can also used
# len(user_file.count(numeric_only=False).index)

### 5.Print the name of all the columns.

In [7]:
x=list(user_file.columns)
for i in x:
    print(i)

user_id
age
gender
occupation
zip_code

### 6.How is the dataset indexed?

In [8]:
user_file_new=pd.read_csv("C:/Users/sushr/Downloads/u.user",sep="|")
print(user_file_new)
print("----------------------------------------------------")
user_file_new.index.name="serial_number"
user_file_new

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]
----------------------------------------------------

               user_id  age gender     occupation zip_code
serial_number
0                    1   24      M     technician    85711
1                    2   53      F          other    94043
2                    3   23      M         writer    32067
3                    4   24      M     technician    43537
4                    5   33      F          other    15213
...                ...  ...    ...            ...      ...
938                939   26      F        student    33319
939                940   32      M  administrator    02215
940                941   20      M        student    97229
941                942   48      F      librarian    78209
942                943   22      M        student    77841

[943 rows x 5 columns]

In [9]:
n=user_file_new.set_index("user_id")
n

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

### 7.What is datatype of each cloumn?

In [10]:
user_file.dtypes

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### 8.How many different occupation are in this dataset?

In [11]:
m=pd.Series.unique(user_file["occupation"])
print(m)
print("")
print(f"The total number of occupation are : {m.shape[0]}")

['technician' 'other' 'writer' 'executive' 'administrator' 'student'
 'lawyer' 'educator' 'scientist' 'entertainment' 'programmer' 'librarian'
 'homemaker' 'artist' 'engineer' 'marketing' 'none' 'healthcare' 'retired'
 'salesman' 'doctor']

The total number of occupation are : 21

### 9.What is the most frequent occupation?

In [12]:
# can be used ---->user_file.groupby("occupation").size().sort_values(ascending=False).index[0]
user_file.groupby("occupation").size().sort_values(ascending=False).iloc[:1]

occupation
student    196
dtype: int64

# 10.Summarize the DataFrame.

In [13]:
user_file.info()
print("")
user_file.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     943 non-null    int64
 1   age         943 non-null    int64
 2   gender      943 non-null    object
 3   occupation  943 non-null    object
 4   zip_code    943 non-null    object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

### 11.Summarize all the columns

In [14]:
user_file.describe(include="all")

           user_id         age gender occupation zip_code
count   943.000000  943.000000    943        943      943
unique         NaN         NaN      2         21      795
top            NaN         NaN      M    student    55414
freq           NaN         NaN    670        196        9
mean    472.000000   34.051962    NaN        NaN      NaN
std     272.364951   12.192740    NaN        NaN      NaN
min       1.000000    7.000000    NaN        NaN      NaN
25%     236.500000   25.000000    NaN        NaN      NaN
50%     472.000000   31.000000    NaN        NaN      NaN
75%     707.500000   43.000000    NaN        NaN      NaN
max     943.000000   73.000000    NaN        NaN      NaN

### What is the age with least occurence?

In [19]:
print(user_file["age"].value_counts().idxmin(),"\n is the least occuring age")
print(user_file["age"].value_counts(),"\n")

11
 is the least occuring age
30    39
25    38
22    37
28    36
27    35
      ..
11     1
10     1
73     1
66     1
7      1
Name: age, Length: 61, dtype: int64

In [33]:
# different approach
user_file["age"].value_counts().tail()

11    1
10    1
73    1
66    1
7     1
Name: age, dtype: int64

## Load Json file

### read a raw_nyc_phil.json data

In [37]:
import pandas as pd

In [38]:
json_file=pd.read_json("C:/Users/sushr/Downloads/raw_nyc_phil.json")

In [39]:
json_file.head()

                                            programs
0  {'season': '1842-43', 'orchestra': 'New York P...
1  {'season': '1842-43', 'orchestra': 'New York P...
2  {'season': '1842-43', 'orchestra': 'Musicians ...
3  {'season': '1842-43', 'orchestra': 'New York P...
4  {'season': '1843-44', 'orchestra': 'New York P...

### Normalize a json data so that you get an output with columns
- Date ,eventType, Venue, Location, Time, id, orchestra, programID ,season

In [40]:
# Normalizing the raw json file and assigning to a new Dataframe named'new_file'
new_file=pd.json_normalize(json_file["programs"])

In [41]:
# First 5 rows of new_file Dataframe
new_file.head()

,season,orchestra,concerts,programID,works,id
0,1842-43,New York Philharmonic,"[{'Date': '1842-12-07T05:00:00Z', 'eventType':...",3853,"[{'workTitle': 'SYMPHONY NO. 5 IN C MINOR, OP....",38e072a7-8fc9-4f9a-8eac-3957905c0002
1,1842-43,New York Philharmonic,"[{'Date': '1843-02-18T05:00:00Z', 'eventType':...",5178,[{'workTitle': 'SYMPHONY NO. 3 IN E FLAT MAJOR...,c7b2b95c-5e0b-431c-a340-5b37fc860b34
2,1842-43,Musicians from the New York Philharmonic,"[{'Date': '1843-04-07T05:00:00Z', 'eventType':...",10785,"[{'workTitle': 'EGMONT, OP.84', 'composerName'...",894e1a52-1ae5-4fa7-aec0-b99997555a37
3,1842-43,New York Philharmonic,"[{'Date': '1843-04-22T05:00:00Z', 'eventType':...",5887,"[{'workTitle': 'SYMPHONY NO. 2 IN D MAJOR, OP....",34ec2c2b-3297-4716-9831-b538310462b7
4,1843-44,New York Philharmonic,"[{'Date': '1843-11-18T05:00:00Z', 'eventType':...",305,"[{'workTitle': 'SYMPHONY NO. 7 IN A MAJOR, OP....",610a4acc-94e4-4cd6-bdc1-8ad020edc7e9

In [45]:
# Flattening one of the column having nested dictionary named 'concerts'
# This Dataframe will include "season","orchestra","programID","id","works" columns with concerts

new_data=pd.json_normalize(data=json_file["programs"],record_path="concerts",meta=["id","orchestra","programID","season"])

In [43]:
# Dataframe with flattened 'concerts' column with 'works' column of nested dictionaries
new_data.head()

,Date,eventType,Venue,Location,Time,season,orchestra,programID,id
0,1842-12-07T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM,1842-43,New York Philharmonic,3853,38e072a7-8fc9-4f9a-8eac-3957905c0002
1,1843-02-18T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM,1842-43,New York Philharmonic,5178,c7b2b95c-5e0b-431c-a340-5b37fc860b34
2,1843-04-07T05:00:00Z,Special,Apollo Rooms,"Manhattan, NY",8:00PM,1842-43,Musicians from the New York Philharmonic,10785,894e1a52-1ae5-4fa7-aec0-b99997555a37
3,1843-04-22T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM,1842-43,New York Philharmonic,5887,34ec2c2b-3297-4716-9831-b538310462b7
4,1843-11-18T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",None,1843-44,New York Philharmonic,305,610a4acc-94e4-4cd6-bdc1-8ad020edc7e9

In [46]:
# Rearranging the columns of Dataframe 
newdata_modified=new_data.reindex(columns=["Date","eventType","Venue","Location","Time","id","orchestra","programID","season"])

In [47]:
# Dataframe without 'works' column and rearranged
newdata_modified.head()

,Date,eventType,Venue,Location,Time,id,orchestra,programID,season
0,1842-12-07T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM,38e072a7-8fc9-4f9a-8eac-3957905c0002,New York Philharmonic,3853,1842-43
1,1843-02-18T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM,c7b2b95c-5e0b-431c-a340-5b37fc860b34,New York Philharmonic,5178,1842-43
2,1843-04-07T05:00:00Z,Special,Apollo Rooms,"Manhattan, NY",8:00PM,894e1a52-1ae5-4fa7-aec0-b99997555a37,Musicians from the New York Philharmonic,10785,1842-43
3,1843-04-22T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM,34ec2c2b-3297-4716-9831-b538310462b7,New York Philharmonic,5887,1842-43
4,1843-11-18T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",None,610a4acc-94e4-4cd6-bdc1-8ad020edc7e9,New York Philharmonic,305,1843-44

### Normalize a json data to get an output with columns 
- soloistName ,soloistRoles, soloistInstrument ,id

In [49]:
# Showing the first 5 rows of column'works' which includes nested dictionaries in Dataframe'new_data'
new_file["works"][:5]

0    [{'workTitle': 'SYMPHONY NO. 5 IN C MINOR, OP....
1    [{'workTitle': 'SYMPHONY NO. 3 IN E FLAT MAJOR...
2    [{'workTitle': 'EGMONT, OP.84', 'composerName'...
3    [{'workTitle': 'SYMPHONY NO. 2 IN D MAJOR, OP....
4    [{'workTitle': 'SYMPHONY NO. 7 IN A MAJOR, OP....
Name: works, dtype: object

In [50]:
# Normalizing the column 'works' and including column 'id'
work_data=pd.json_normalize(data=json_file["programs"],record_path="works",meta=["id"])

In [51]:
# Showing first 5 rows of Dataframe 'work_data'
work_data.head()

,workTitle,conductorName,ID,soloists,composerName,movement,interval,movement.em,movement._,workTitle.em,workTitle._,id
0,"SYMPHONY NO. 5 IN C MINOR, OP.67","Hill, Ureli Corelli",52446*,[],"Beethoven, Ludwig van",NaN,NaN,NaN,NaN,NaN,NaN,38e072a7-8fc9-4f9a-8eac-3957905c0002
1,OBERON,"Timm, Henry C.",8834*4,"[{'soloistName': 'Otto, Antoinette', 'soloistR...","Weber, Carl Maria Von","""Ozean, du Ungeheuer"" (Ocean, thou mighty mons...",NaN,NaN,NaN,NaN,NaN,38e072a7-8fc9-4f9a-8eac-3957905c0002
2,"QUINTET, PIANO, D MINOR, OP. 74",NaN,3642*,"[{'soloistName': 'Scharfenberg, William', 'sol...","Hummel, Johann",NaN,NaN,NaN,NaN,NaN,NaN,38e072a7-8fc9-4f9a-8eac-3957905c0002
3,NaN,NaN,0*,[],NaN,NaN,Intermission,NaN,NaN,NaN,NaN,38e072a7-8fc9-4f9a-8eac-3957905c0002
4,OBERON,"Etienne, Denis G.",8834*3,[],"Weber, Carl Maria Von",Overture,NaN,NaN,NaN,NaN,NaN,38e072a7-8fc9-4f9a-8eac-3957905c0002

In [52]:
# Normalizing the column 'soloists' which present inside the column 'works' and including column 'id'
soloist_data=pd.json_normalize(data=json_file["programs"],record_path=["works","soloists"],meta="id")

In [54]:
# Flattened 'soloists' column 
soloist_data

,soloistName,soloistRoles,soloistInstrument,id
0,"Otto, Antoinette",S,Soprano,38e072a7-8fc9-4f9a-8eac-3957905c0002
1,"Scharfenberg, William",A,Piano,38e072a7-8fc9-4f9a-8eac-3957905c0002
2,"Hill, Ureli Corelli",A,Violin,38e072a7-8fc9-4f9a-8eac-3957905c0002
3,"Derwort, G. H.",A,Viola,38e072a7-8fc9-4f9a-8eac-3957905c0002
4,"Boucher, Alfred",A,Cello,38e072a7-8fc9-4f9a-8eac-3957905c0002
...,...,...,...,...
56189,"Xu, Weiqin",S,Baritone,68625626-8085-44e4-bdb3-d8e6ac51c95b
56190,"Martin, Christopher",S,Trumpet,5c22d35f-a282-4505-bd31-df619c74f52b
56191,"Shryock, Grace",S,English Horn,5c22d35f-a282-4505-bd31-df619c74f52b
56192,Jazz at Lincoln Center Orchestra with Wynton M...,S,Jazz Ensemble,5c22d35f-a282-4505-bd31-df619c74f52b
56193,Jazz at Lincoln Center Orchestra with Wynton M...,S,Jazz Ensemble,5c22d35f-a282-4505-bd31-df619c74f52b

### Normalize a json to get an output with columns
- soloistName, soloistRoles, soloistInstrument, id ,orchestra, programID ,season ,Date, eventType, Venue ,Location, Time

In [76]:
P1=pd.json_normalize(data=json_file["programs"],record_path=["works","soloists"],meta=["id","concerts"])

In [77]:
P1

,soloistName,soloistRoles,soloistInstrument,id,concerts
0,"Otto, Antoinette",S,Soprano,38e072a7-8fc9-4f9a-8eac-3957905c0002,"[{'Date': '1842-12-07T05:00:00Z', 'eventType':..."
1,"Scharfenberg, William",A,Piano,38e072a7-8fc9-4f9a-8eac-3957905c0002,"[{'Date': '1842-12-07T05:00:00Z', 'eventType':..."
2,"Hill, Ureli Corelli",A,Violin,38e072a7-8fc9-4f9a-8eac-3957905c0002,"[{'Date': '1842-12-07T05:00:00Z', 'eventType':..."
3,"Derwort, G. H.",A,Viola,38e072a7-8fc9-4f9a-8eac-3957905c0002,"[{'Date': '1842-12-07T05:00:00Z', 'eventType':..."
4,"Boucher, Alfred",A,Cello,38e072a7-8fc9-4f9a-8eac-3957905c0002,"[{'Date': '1842-12-07T05:00:00Z', 'eventType':..."
...,...,...,...,...,...
56189,"Xu, Weiqin",S,Baritone,68625626-8085-44e4-bdb3-d8e6ac51c95b,"[{'Date': '2017-07-04T04:00:00Z', 'eventType':..."
56190,"Martin, Christopher",S,Trumpet,5c22d35f-a282-4505-bd31-df619c74f52b,"[{'Date': '2017-07-07T04:00:00Z', 'eventType':..."
56191,"Shryock, Grace",S,English Horn,5c22d35f-a282-4505-bd31-df619c74f52b,"[{'Date': '2017-07-07T04:00:00Z', 'eventType':..."
56192,Jazz at Lincoln Center Orchestra with Wynton M...,S,Jazz Ensemble,5c22d35f-a282-4505-bd31-df619c74f52b,"[{'Date': '2017-07-07T04:00:00Z', 'eventType':..."
56193,Jazz at Lincoln Center Orchestra with Wynton M...,S,Jazz Ensemble,5c22d35f-a282-4505-bd31-df619c74f52b,"[{'Date': '2017-07-07T04:00:00Z', 'eventType':..."

In [78]:
concert=P1["concerts"].apply(pd.Series)
P2=pd.json_normalize(concert[0])

In [79]:
P2

,Date,eventType,Venue,Location,Time
0,1842-12-07T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM
1,1842-12-07T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM
2,1842-12-07T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM
3,1842-12-07T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM
4,1842-12-07T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM
...,...,...,...,...,...
56189,2017-07-04T04:00:00Z,Tour - Young People's Concert,Shanghai Symphony Hall--Chamber Hall,"Shanghai, CHINA",7:30PM
56190,2017-07-07T04:00:00Z,Tour,Shanghai Symphony Hall,"Shanghai, CHINA",7:30PM
56191,2017-07-07T04:00:00Z,Tour,Shanghai Symphony Hall,"Shanghai, CHINA",7:30PM
56192,2017-07-07T04:00:00Z,Tour,Shanghai Symphony Hall,"Shanghai, CHINA",7:30PM
56193,2017-07-07T04:00:00Z,Tour,Shanghai Symphony Hall,"Shanghai, CHINA",7:30PM

In [80]:
final=pd.concat([P1,P2],axis=1)

In [85]:
final.drop(columns="concerts",inplace=True)

In [86]:
final

,soloistName,soloistRoles,soloistInstrument,id,Date,eventType,Venue,Location,Time
0,"Otto, Antoinette",S,Soprano,38e072a7-8fc9-4f9a-8eac-3957905c0002,1842-12-07T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM
1,"Scharfenberg, William",A,Piano,38e072a7-8fc9-4f9a-8eac-3957905c0002,1842-12-07T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM
2,"Hill, Ureli Corelli",A,Violin,38e072a7-8fc9-4f9a-8eac-3957905c0002,1842-12-07T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM
3,"Derwort, G. H.",A,Viola,38e072a7-8fc9-4f9a-8eac-3957905c0002,1842-12-07T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM
4,"Boucher, Alfred",A,Cello,38e072a7-8fc9-4f9a-8eac-3957905c0002,1842-12-07T05:00:00Z,Subscription Season,Apollo Rooms,"Manhattan, NY",8:00PM
...,...,...,...,...,...,...,...,...,...
56189,"Xu, Weiqin",S,Baritone,68625626-8085-44e4-bdb3-d8e6ac51c95b,2017-07-04T04:00:00Z,Tour - Young People's Concert,Shanghai Symphony Hall--Chamber Hall,"Shanghai, CHINA",7:30PM
56190,"Martin, Christopher",S,Trumpet,5c22d35f-a282-4505-bd31-df619c74f52b,2017-07-07T04:00:00Z,Tour,Shanghai Symphony Hall,"Shanghai, CHINA",7:30PM
56191,"Shryock, Grace",S,English Horn,5c22d35f-a282-4505-bd31-df619c74f52b,2017-07-07T04:00:00Z,Tour,Shanghai Symphony Hall,"Shanghai, CHINA",7:30PM
56192,Jazz at Lincoln Center Orchestra with Wynton M...,S,Jazz Ensemble,5c22d35f-a282-4505-bd31-df619c74f52b,2017-07-07T04:00:00Z,Tour,Shanghai Symphony Hall,"Shanghai, CHINA",7:30PM
56193,Jazz at Lincoln Center Orchestra with Wynton M...,S,Jazz Ensemble,5c22d35f-a282-4505-bd31-df619c74f52b,2017-07-07T04:00:00Z,Tour,Shanghai Symphony Hall,"Shanghai, CHINA",7:30PM